var d = {
  'Сь': 'Ś',
  'Ць': 'Ć',
  'Нь': 'Ń',
  'Ль': 'Ĺ',
  'Ть': 'Ť',
  'Дь': 'Ď',
  'Зь': 'Ź',

  'сь': 'ś',
  'ць': 'ć',
  'нь': 'ń',
  'ль': 'ĺ',
  'ть': 'ť',
  'дь': 'ď',
  'зь': 'ź',

  'ає': 'aje',
  'еє': 'eje',
  'иє': 'yje',
  'іє': 'ije',
  'їє': 'jije',
  'оє': 'oje',
  'ує': 'uje',
  'єє': 'jeje',
  'ює': 'juje',
  'яє': 'jaje',
  'Ає': 'Aje',
  'Еє': 'Eje',
  'Иє': 'Yje',
  'Іє': 'Ije',
  'Їє': 'Jije',
  'Оє': 'Oje',
  'Ує': 'Uje',
  'Єє': 'Jeje',
  'Ює': 'Juje',
  'Яє': 'Jaje',

  'аю': 'aju',
  'ею': 'eju',
  'ию': 'yju',
  'ію': 'iju',
  'їю': 'jiju',
  'ою': 'oju',
  'ую': 'uju',
  'єю': 'jeju',
  'юю': 'juju',
  'яю': 'jaju',
  'Аю': 'Aju',
  'Ею': 'Eju',
  'Ию': 'Yju',
  'Ію': 'Iju',
  'Їю': 'Jiju',
  'Ою': 'Oju',
  'Ую': 'Uju',
  'Єю': 'Jeju',
  'Юю': 'Juju',
  'Яю': 'Jaju',

  'ая': 'aja',
  'ея': 'eja',
  'ия': 'yja',
  'ія': 'ija',
  'їя': 'jija',
  'оя': 'oja',
  'уя': 'uja',
  'єя': 'jeja',
  'юя': 'juja',
  'яя': 'jaja',
  'Ая': 'Aja',
  'Ея': 'Eja',
  'Ия': 'Yja',
  'Ія': 'Ija',
  'Їя': 'Jija',
  'Оя': 'Oja',
  'Уя': 'Uja',
  'Єя': 'Jeja',
  'Юя': 'Juja',
  'Яя': 'Jaja',

  ' Є': ' Je',
  ' Ю': ' Ju',
  ' Я': ' Ja',
  ' є': ' je',
  ' ю': ' ju',
  ' я': ' ja',

  '’є': 'je',
  '’ю': 'ju',
  '’я': 'ja',
  '’ї': 'ji',

  '\'є': 'je',
  '\'ю': 'ju',
  '\'я': 'ja',
  '\'ї': 'ji',

};

var a = {
'А': 'A', 'а': 'a', 'Б': 'B', 'б': 'b', 'В': 'V', 'в': 'v', 'Г': 'H', 'г': 'h', 'Ґ': 'G', 'ґ': 'g', 'Д': 'D', 'д': 'd', 'Е': 'E', 'е': 'e', 'Ж': 'Ž', 'ж': 'ž', 'З': 'Z', 'з': 'z', 'И': 'Y', 'и': 'y', 'І': 'I', 'і': 'i', 'Ї': 'Ji', 'ї': 'ji', 'Й': 'J', 'й': 'j', 'К': 'K', 'к': 'k', 'Л': 'L', 'л': 'l', 'М': 'M', 'м': 'm', 'Н': 'N', 'н': 'n', 'О': 'O', 'о': 'o', 'П': 'P', 'п': 'p', 'Р': 'R', 'р': 'r', 'С': 'S', 'с': 's', 'Т': 'T', 'т': 't', 'У': 'U', 'у': 'u', 'Ф': 'F', 'ф': 'f', 'Х': 'Ch', 'х': 'ch', 'Ц': 'C', 'ц': 'c', 'Ч': 'Č', 'ч': 'č', 'Ш': 'Š', 'ш': 'š', 'Щ': 'Šč', 'щ': 'šč', 'Є': 'Je', 'є': 'ie', 'Ю': 'Ju', 'ю': 'iu', 'Я': 'Ja', 'я': 'ia'
};

function escapeRegExp(string) {
    return string.replace(/([.*+?^=!:${}()|\[\]\/\\])/g, "\\$1");
}
function replaceAll(string, find, replace) {
  return string.replace(new RegExp(escapeRegExp(find), 'g'), replace);
}

function transliterate(word){
  for (var i in d) {
    word = replaceAll(word, i, d[i]);
  };

  return word.split("\n").map(function(line) {
    return line.split('').map(function(char) { 
      return a[char] || char; 
    }).join("")
  }).join("\n");
}


var text = "\
  Хотілося б детальніше ознайомитися із засадами проекту українського правопису цього вченого... Зокрема мене цікавить таке: \n\
  1) перелік літер альфабету та їх назов; \n\
  2) чи впливали діякритики на розташування слів за альфабетом; \n\
  3) позначення сполучення м’якого приголосного з голосним; \n\
  4) позначення сполучення губного приголосного з йотованим голосним; \n\
  5) правопис слів типу святий, червяк, де губний у літературній вимові пом’якшується; \n\
  6) чи розрізнялось м’яке р перед голосним та тверде р перед йотованим голосним (що не властиво галицькій вимові: рйабий, бурйан); \n\
  7) чи позначалась м’якість р у кінці складу; \n\
  8) правопис іменникових закінчень з давніх -іе, -ье, зокрема після шиплячих, губних та р; \n\
  9) правопис і < и на початку слова (вимовляється чітко як [и] або подібно до нього), після голосного (вимовляється з йотацією), після приголосного (у м’яких прикметниках, слові \"третій\", в закінченнях непрямих відмінків іменників - якщо таке взагалі мало місце, бо не зовсім властиве західнянській вимові: синий, третий, синови, уночи).\
";

/*
console.log((text));
console.log(transliterate(text));
*/
